const errorMsg = {
    baidu: {
        52000: '成功',
        52001: '请求超时，请重试',
        52002: '系统错误，请重试',
        52003: '检查您的 appid 是否正确，或者服务是否开通',
        54000: '必填参数为空',
        54001: '检查您的密钥是否正确',
        54002: '访问频率受限',
        54003: '账户余额不足',
        54004: '请降低长query的发送频率，3s后再试',
        54005: '客户端IP非法',
        58000: '译文语言方向不支持',
        58001: '服务当前已关闭',
        58002: '认证未通过或未生效'
    },
    youdao: {
        101: '缺少必填的参数',
        102: '不支持的语言类型',
        103: '翻译文本过长',
        104: '不支持的API类型',
        105: '不支持的签名类型',
        106: '不支持的响应类型',
        107: '不支持的传输加密类型',
        108: '应用ID无效',
        109: 'batchLog格式不正确',
        110: '无相关服务的有效实例',
        111: '开发者账号无效',
        113: '翻译源文本不能为空',
        201: '解密失败',
        202: '检查您的密钥是否正确',
        203: '访问IP地址不在可访问IP列表',
        205: '请求的接口与应用的平台类型不一致',
        206: '因为时间戳无效导致签名校验失败',
        207: '重放请求',
        301: '辞典查询失败',
        302: '翻译查询失败',
        303: '服务端的其它异常',
        401: '账户已经欠费停',
        411: '访问频率受限,请稍后访问',
        412: '长请求过于频繁，请稍后访问'
    }
}

module.exports = errorMsg